'''
개미
'''
w, h = map(int, input().split())
p, q = map(int, input().split())
t = int(input())
x = (p + t) % (2 * w)
y = (q + t) % (2 * h)
x = w - abs(w - x)
y = h - abs(h - y)
print(x, y)
'''
t   0   1   2   3   4   5   6   7   8   9   10
x   p  p+1 p+2 p+3 p+4  w  w-1 w-2 w-4 w-4 w-5 ... 0 1 2 ... w ... 0
y   q  q+1 q+2  h  h-1 h-2 h-3 h-4  0   1   2 ... h ... 0 ... h ... 0

x는 2 * w 가 주기       ex) p = 3, t = 14, w = 5 -> (0, 1, 2, )3 4 5 4 3 2 1 0 1 2 3 4 5 4 3
                      ex) p = 3, t = 4, w = 5 -> (0, 1, 2, )3 4 5 4 3
y는 2 * h 가 주기

따라서 (p + t) % (2 * w)를 계산하나 p + t를 계산하나 같음

ex) p = 3, w = 5, 

    x = 0 -> t = 7  3, 4, 5, 4, 3, 2, 1, 0                                      x = 0일 때 좌표가 0
    x = 1 -> t = 8                          , 1
    ...
    x = 4 -> t = 11                         , 1, 2, 3, 4

    x = 5 -> t = 12                         , 1, 2, 3, 4, 5                     x = w일 때 좌표가 w
    
    x = 6 -> t = 13                         , 1, 2, 3, 4, 5, 4
    ...
    x = 9 -> t = 16                         , 1, 2, 3, 4, 5, 4, 3, 2, 1
    x = 9 -> t = 16                         , 1, 2, 3, 4, 5, 4, 3, 2, 1, 0      x = 2w일 때 좌표가 0
'''